

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ///.........///

    ИзменитьФорму();

КонецПроцедуры

&НаСервере
Процедура ИзменитьФорму()
        
    НовыйЭлемент1 = Элементы.Добавить("НоваяСтраница",Тип("ГруппаФормы"),Элементы.Group1);
    НовыйЭлемент1.Вид = ВидГруппыФормы.Страница;
    НовыйЭлемент1.Заголовок = "НоваяСтраница";
        
    НовыйЭлемент2 = Элементы.Добавить("НоваяНадпись",Тип("ДекорацияФормы"),НовыйЭлемент1);
    НовыйЭлемент2.Заголовок = "НоваяНадпись";
    
    НовыйЭлемент3 = Элементы.Добавить("НоваяСтраница3",Тип("ГруппаФормы"),Элементы.Group1);
    НовыйЭлемент3.Вид = ВидГруппыФормы.Страница;
    НовыйЭлемент3.Заголовок = "НоваяСтраница";
    
    НовыйЭлемент4 = Элементы.Добавить("НоваяНадпись4",Тип("ДекорацияФормы"),НовыйЭлемент3);
    НовыйЭлемент4.Заголовок = "НоваяНадпись";
КонецПроцедуры